'''
@description 2019/08/30 23:12
'''

# 1. +：加号运算符
# a = 11
# b = 22
# c = a + b
# print(c) # 33
# # 简写模式：+=：a+=1等价于 a=a+1 
# a += b
# print(a) # 33

# 2. -: 减号运算符
# a = 22
# b = 11
# c = a - b
# print(c) # 11
# # 简写模式：-=：a-=1等价于a=a-1。
# a -= b
# print(a) # 11

# 3. *: 乘号运算符
# a = 11
# b = 2
# c = a * b
# print(c) # 22
# # 简写模式：*=：a*=2等价于a=a*2
# a *= b
# print(a) # 22

# 4. /: 除法运算符
# a = 11
# b = 2
# c = a / b
# print(c) # 5.5
# # 简写模式：/=：a/=2等价于a=a/2。
# a /= b
# print(a) # 5.5

# 5. //: 取整除
# a = 11
# b = 2
# c = a // b
# print(c) # 5
# # 简写模式：//=：a //= 2等价于a = a//2。
# a //= b
# print(a) # 5

# 6. %: 取余
# a = 11
# b = 2
# c = a % b
# print(c) # 1
# # 简写模式：%=：a%=2等价于a=a%2。
# a %= b
# print(a) # 1

# 7. **： 幂运算
a = 2
b = 10
c = a ** b
print(c) # 1024
# 简写模式：**=：a **= 2等价于a = a**2。
a **= b
print(a) # 1024


